codeigniter4-framework-b3359be/app/Controllers/Catalogue.php

SELECT *
FROM `livres`
WHERE `livres`.`id` = '1'
---
    public function details($id)
    {
        $livreModel = new LivreModel();
        $empruntModel = new EmpruntModel();

        $livre = $livreModel->find($id);