codeigniter4-framework-b3359be/app/Models/EmpruntModel.php

    public function getDernierEmpruntParLivre(int $livreId): ?array
    {
        return $this->where('livre_id', $livreId)
            ->orderBy('date_emprunt', 'DESC')
            ->first();
---
SELECT *
FROM `emprunts`
WHERE `livre_id` = 31
ORDER BY `date_emprunt` DESC
 LIMIT 1