codeigniter4-framework-b3359be/app/Models/LivreModel.php

SELECT *
FROM `livres`
ORDER BY `titre` ASC
 LIMIT 20, 10
SELECT COUNT(*) AS `numrows`
FROM `livres`
---
    public function getLivresPagine(int $parPage = 10, string $group = 'livres')
    {
        return $this->orderBy('titre', 'ASC')->paginate($parPage, $group);